{
  "experiences": [
    {
      "role": "Frontend Tech Lead",
      "company": "EFEX",
      "period": "2025 — Present",
      "description": "Lead frontend architecture, design systems, and developer tooling at EFEX. Focused on scalability, code reuse, and engineering best practices.",
      "technologies": ["React", "TypeScript", "Nx", "Module Federation", "Material UI", "Storybook", "Zustand", "Vite"],
      "achievements": [
        "Architected and standardized the entire frontend infrastructure using Nx and Module Federation",
        "Built internal libraries for design tokens, theming, components, HTTP handling, and error management",
        "Developed an internal CLI to automate changelogs, QA, releases, and branching workflows",
        "Led cross-team architecture decisions, documentation efforts, and code reviews"
      ]
    },
    {
      "role": "Senior Frontend Engineer",
      "company": "EFEX",
      "period": "2023 — 2025",
      "description": "Developed and maintained scalable interfaces and internal tooling across EFEX platforms. Focused on UI quality, reusable code, and developer efficiency.",
      "technologies": ["React", "TypeScript", "Material UI", "React Hook Form", "Zustand"],
      "achievements": [
        "Helped build EFEX’s shared component library from scratch",
        "Collaborated with cross-functional teams to deliver robust and accessible user experiences",
        "Laid the groundwork for internal tools that evolved into company-wide CLI solutions"
      ]
    },
    {
      "role": "Senior Frontend Engineer",
      "company": "Branch",
      "period": "2022 — 2024",
      "description": "Worked on the core product team with a focus on clean architecture and frontend scalability.",
      "technologies": ["React", "TypeScript", "Tailwind CSS", "React Hook Form", "Zustand"],
      "achievements": [
        "Implemented modular and scalable UI solutions",
        "Improved developer onboarding by formalizing internal frontend practices",
        "Collaborated on cross-team delivery of complex features"
      ]
    },
    {
      "role": "Tech Lead / Senior Frontend Developer",
      "company": "Globant (American Century Investments)",
      "period": "2020 — 2022",
      "description": "Led frontend delivery for enterprise-scale web solutions with React and modular architecture.",
      "technologies": ["React", "JavaScript", "Redux", "SASS", "Material UI"],
      "achievements": [
        "Defined frontend standards and team mentoring practices",
        "Drove architecture improvements and enforced code quality across teams",
        "Shipped features to production with accessibility and performance in mind"
      ]
    },
    {
      "role": "Chief UX Officer / Web Frontend Developer",
      "company": "Minds With Purpose Ltd",
      "period": "2020 — 2024",
      "description": "Led UX and frontend development for educational and social impact platforms.",
      "technologies": ["React", "Vue.js", "CSS3", "Node.js", "Figma"],
      "achievements": [
        "Designed full UI/UX flows and built responsive SPAs",
        "Developed inclusive, accessible web experiences",
        "Conducted user testing and usability enhancements"
      ]
    }
  ]
}